<a href="https://colab.research.google.com/github/sathwika0324/Assignment/blob/main/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
# Load the dataset
df = pd.read_csv('train.csv')  # Make sure 'train.csv' is in the current working directory

# Display the first few rows to verify the data is loaded correctly
print(df.head())

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type     Mileage   Engine  \
0              41000    Diesel       Manual      First  19.67 kmpl  1582 CC
1              46000    Petrol       Manual      First    13 km/kg  1199 CC
2              87000    Diesel       Manual      First  20.77 kmpl  1248 CC
3              40670    Diesel    Automatic     Second   15.2 kmpl  1968 CC
4              86999    Diesel       Manual      First  23.08 kmpl  1461 CC

       Power  Seats  New_Price  Price
0  126.2 bhp    5.0        NaN  12.50
1   88.7 bhp    5.0  8.61 Lakh   4.50
2  88.76 bhp    7.0        NaN   6.00
3  140.8 bhp    5.0        NaN  17.74
4   63.1 bhp    5.0        NaN   3.50

In [3]:
# Function to clean and convert columns by removing non-numeric characters
def clean_numeric_column(column):
    # Remove non-numeric characters and convert to float
    return pd.to_numeric(column.str.replace(r'[^0-9.]', '', regex=True), errors='coerce')

In [4]:
# Clean numerical columns
numerical_columns = ['Mileage', 'Engine', 'Power']  # Update this list based on your dataset
for col in numerical_columns:
    if col in df.columns:
        df[col] = clean_numeric_column(df[col])  # Clean the column

 Look for the missing values in all the columns and either impute them (replace with mean,
median, or mode) or drop them. Justify your action for this task.

In [5]:
# Check for missing values
missing_values = df.isnull().sum()
print("Missing values in each column:\n", missing_values)# Check for missing values

Missing values in each column:
 Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  38
New_Price            5032
Price                   0
dtype: int64

In [7]:
# Impute numerical columns with median, as it is less affected by outliers
for col in numerical_columns:
    if col in df.columns:
        # Fill missing values with the median of the column and assign back
        df[col] = df[col].fillna(df[col].median())

In [8]:
# Impute categorical columns with mode (most frequent value)
categorical_columns = ['Seats']  # Update this list based on your dataset
for col in categorical_columns:
    if col in df.columns:
        df[col] = df[col].fillna(df[col].mode()[0])  # Impute with mode

In [9]:
# Drop rows where the target variable 'Price' is missing, since it's the focus of the analysis
df.dropna(subset=['Price'], inplace=True)

In [10]:
# Check again to confirm no missing values remain
missing_values_after = df.isnull().sum()
print("\nMissing values after handling:\n", missing_values_after)

Missing values after handling:
 Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                  0
Power                   0
Seats                   0
New_Price            5032
Price                   0
dtype: int64

Remove the units from some of the attributes and only keep the numerical values (for
example remove kmpl from “Mileage”, CC from “Engine”, bhp from “Power”, and lakh from
“New_price”).

In [11]:
def clean_numeric_column(column):
    # Ensure the column is treated as a string, then remove non-numeric characters
    return pd.to_numeric(column.astype(str).str.replace(r'[^0-9.]', '', regex=True), errors='coerce')

In [12]:
# Clean specific columns
if 'Mileage' in df.columns:
    df['Mileage'] = clean_numeric_column(df['Mileage'])

In [13]:
if 'Engine' in df.columns:
    df['Engine'] = clean_numeric_column(df['Engine'])

In [14]:
if 'Power' in df.columns:
    df['Power'] = clean_numeric_column(df['Power'])

In [15]:
if 'New_price' in df.columns:
    df['New_price'] = clean_numeric_column(df['New_price'])

In [16]:
# Display the cleaned DataFrame
print(df.head())

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0              41000    Diesel       Manual      First    19.67  1582.0
1              46000    Petrol       Manual      First    13.00  1199.0
2              87000    Diesel       Manual      First    20.77  1248.0
3              40670    Diesel    Automatic     Second    15.20  1968.0
4              86999    Diesel       Manual      First    23.08  1461.0

    Power  Seats  New_Price  Price
0  126.20    5.0        NaN  12.50
1   88.70    5.0  8.61 Lakh   4.50
2   88.76    7.0        NaN   6.00
3  140.80    5.0        NaN  17.74
4   63.10    5.0        NaN   3.50

Change the categorical variables (“Fuel_Type” and “Transmission”) into numerical one hot
encoded value

In [18]:
# One-hot encode categorical variables
df = pd.get_dummies(df, columns=['Fuel_Type', 'Transmission'], drop_first=True)

In [19]:
# Display the updated DataFrame
print(df.head())

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
0              41000      First    19.67  1582.0  126.20    5.0        NaN
1              46000      First    13.00  1199.0   88.70    5.0  8.61 Lakh
2              87000      First    20.77  1248.0   88.76    7.0        NaN
3              40670     Second    15.20  1968.0  140.80    5.0        NaN
4              86999      First    23.08  1461.0   63.10    5.0        NaN

   Price  Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual
0  12.50               False             False                 True
1   4.50               False              True                 True
2   6.00               False             False                 True
3  17.74               False             False                False
4   3.50               False             False                 True

Create one more feature and add this column to the dataset (you can use mutate function in
R for this). For example, you can calculate the current age of the car by subtracting “Year” value
from the current year.

In [21]:
from datetime import datetime
# Calculate the current year
current_year = datetime.now().year

In [22]:
# Create a new feature 'Car_Age'
df['Car_Age'] = current_year - df['Year']

In [23]:
# Display the updated DataFrame
print(df.head())

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
0              41000      First    19.67  1582.0  126.20    5.0        NaN
1              46000      First    13.00  1199.0   88.70    5.0  8.61 Lakh
2              87000      First    20.77  1248.0   88.76    7.0        NaN
3              40670     Second    15.20  1968.0  140.80    5.0        NaN
4              86999      First    23.08  1461.0   63.10    5.0        NaN

   Price  Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual  Car_Age
0  12.50               False             False                 True        9
1   4.50               False              True                 True       13
2   6.00               False             False                 True       12
3  17.74               False             False                False       11
4   3.50               False             False                 True       11

In [24]:
# Print the column names to check for discrepancies
print("Column Names:\n", df.columns.tolist())

Column Names:
 ['Unnamed: 0', 'Name', 'Location', 'Year', 'Kilometers_Driven', 'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats', 'New_Price', 'Price', 'Fuel_Type_Electric', 'Fuel_Type_Petrol', 'Transmission_Manual', 'Car_Age']

Perform select, filter, rename, mutate, arrange and summarize with group by operations (or
their equivalent operations in python) on this dataset. (4 points)
Submission:
Create a public GitHub repo and upload the folders for the assignment on the GitHub and submit the
link to Canvas.



125%

In [26]:
# 1. Select specific columns (using the actual column names)
selected_columns = df[['Name', 'Year', 'Price', 'Car_Age']]

In [27]:
# 2. Filter rows where the price is greater than a specific value
filtered_data = selected_columns[selected_columns['Price'] > 5]
print("Selected and Filtered Data:\n", filtered_data.head())

Selected and Filtered Data:
                                   Name  Year  Price  Car_Age
0     Hyundai Creta 1.6 CRDi SX Option  2015  12.50        9
2                    Maruti Ertiga VDI  2012   6.00       12
3      Audi A4 New 2.0 TDI Multitronic  2013  17.74       11
5    Toyota Innova Crysta 2.8 GX AT 8S  2016  17.50        8
6  Volkswagen Vento Diesel Comfortline  2013   5.20       11

In [28]:
# 3. Rename columns (e.g., renaming 'Price' to 'Used_Car_Price')
renamed_data = filtered_data.rename(columns={'Price': 'Used_Car_Price'})
print("\nRenamed Data:\n", renamed_data.head())

Renamed Data:
                                   Name  Year  Used_Car_Price  Car_Age
0     Hyundai Creta 1.6 CRDi SX Option  2015           12.50        9
2                    Maruti Ertiga VDI  2012            6.00       12
3      Audi A4 New 2.0 TDI Multitronic  2013           17.74       11
5    Toyota Innova Crysta 2.8 GX AT 8S  2016           17.50        8
6  Volkswagen Vento Diesel Comfortline  2013            5.20       11

In [29]:
# 4. Mutate by creating a new column (already done with Car_Age above)
# Assume we want to mutate to add a price per year feature
renamed_data['Price_Per_Year'] = renamed_data['Used_Car_Price'] / renamed_data['Car_Age']

In [30]:
# 5. Arrange the data by 'Used_Car_Price' in descending order
arranged_data = renamed_data.sort_values(by='Used_Car_Price', ascending=False)
print("\nArranged Data:\n", arranged_data.head())

Arranged Data:
                                              Name  Year  Used_Car_Price  \
3952  Land Rover Range Rover 3.0 Diesel LWB Vogue  2017          160.00
5620                   Lamborghini Gallardo Coupe  2011          120.00
5752                       Jaguar F Type 5.0 V8 S  2015          100.00
1457              Land Rover Range Rover Sport SE  2019           97.07
1917                           BMW 7 Series 740Li  2018           93.67

      Car_Age  Price_Per_Year
3952        7       22.857143
5620       13        9.230769
5752        9       11.111111
1457        5       19.414000
1917        6       15.611667

In [31]:
# 6. Summarize by grouping by 'Name' and calculating the average price
summary = arranged_data.groupby('Name').agg(Average_Price=('Used_Car_Price', 'mean')).reset_index()
print("\nSummary:\n", summary)

Summary:
                                 Name  Average_Price
0          Audi A3 35 TDI Attraction      16.500000
1             Audi A3 35 TDI Premium      19.250000
2        Audi A3 35 TDI Premium Plus      18.900000
3          Audi A3 35 TDI Technology      22.500000
4                   Audi A4 1.8 TFSI       9.000000
...                              ...            ...
1171            Volvo XC60 D4 Summum      18.250000
1172                   Volvo XC60 D5      19.433333
1173       Volvo XC60 D5 Inscription      17.180000
1174  Volvo XC90 2007-2015 D5 AT AWD      23.580000
1175     Volvo XC90 2007-2015 D5 AWD      23.650000

[1176 rows x 2 columns]